#### LevelAssociationData Members

---

|  |
| --- |
| LevelAssociationData Class   Methods   Properties   See Also |

The  LevelAssociationData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LevelAssociationData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAssociatedLevel | Returns the Associated Level id. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetLevelAssociationData | Returns LevelAssociationData associated with this element, if it exists. |
| Public method | GetLevelOffset | Returns the offset from the Associated Level. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetAssociatedLevel | Sets the Associated Level. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

LevelAssociationData Class

Autodesk.Revit.DB Namespace